app/views/tickets/index.html.erb

SELECT "routes".* FROM "routes" ORDER BY "routes"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
<%@route= Route.first%>