app/views/tickets/show.html.erb

  <tbody>
    <% @ticket.passengers.each do |passenger| %>
---
SELECT "passengers".* FROM "passengers" WHERE "passengers"."ticket_id" = $1  [["ticket_id", 15]]