app/controllers/passengers_controller.rb

SELECT "passengers".* FROM "passengers"
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
SELECT "routes".* FROM "routes"
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "routes".* FROM "routes" WHERE "routes"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
---
  def index

    @passengers = Passenger.all
    @ticket = Ticket.find(params[:ticket_id])

    @routes = Route.all
    @route = Route.find_by(id:@ticket.route_id)

SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
SELECT "routes".* FROM "routes" WHERE "routes"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
SELECT "tickets".* FROM "tickets" WHERE "tickets"."route_id" = $1  [["route_id", 34]]
INSERT INTO "passengers" ("name", "age", "mobile", "gender", "ticket_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Kunal"], ["age", "24"], ["mobile", "9907132198"], ["gender", "Male"], ["ticket_id", 23], ["created_at", "2024-03-06 11:47:44.727591"], ["updated_at", "2024-03-06 11:47:44.727591"]]
---
  def create
    @ticket = Ticket.find(params[:ticket_id])
    @passenger = @ticket.passengers.new(passenger_params)
    @route = Route.find_by(id:@ticket.route_id)
    @seats = @route.seats
     if @passenger.save