app/controllers/routes_controller.rb

  def index
    @routes = Route.all
---
SELECT "routes".* FROM "routes" ORDER BY "routes"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def search
    # binding.b
    @routes = Route.all
    @from= params[:from]
    @to= params[:to]
    @date = params[:date]
    @passenger_count = 0
    @all_station = Station.eager_load(:route)
     @s_name = @all_station.pluck(:station_name)
      # @s_name  = @all_station.where(route_id:route.id).pluck(:station_name)

      if (@s_name.include?(@from) && @s_name.include?(@to))
        @a = Station.find_by(station_name:@from)
        @b = Station.find_by(station_name:@to)

        if (@a.route_id == @b.route_id)

          if @a.id < @b.id
            @departure = @a.departure
            @arrival = @b.arrival
            @total_distance = @b.distance - @a.distance
            @fairprice = (@total_distance * 5)
            @route = Route.find_by(id:@a.route_id)
            @seats = @route.seats
            @route_ticket = Ticket.where(route_id:@route.id)

            @route_ticket.each do |r|
---
SELECT "routes".* FROM "routes"
SELECT "stations"."station_name" FROM "stations" LEFT OUTER JOIN "routes" ON "routes"."id" = "stations"."route_id"
SELECT "stations".* FROM "stations" WHERE "stations"."station_name" = $1 LIMIT $2  [["station_name", "bhopal"], ["LIMIT", 1]]
SELECT "stations".* FROM "stations" WHERE "stations"."station_name" = $1 LIMIT $2  [["station_name", "Hydrabad"], ["LIMIT", 1]]
SELECT "stations".* FROM "stations" WHERE "stations"."route_id" = $1  [["route_id", 1]]
SELECT "routes".* FROM "routes" WHERE "routes"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
SELECT "tickets".* FROM "tickets" WHERE "tickets"."route_id" = $1  [["route_id", 1]]
SELECT "tickets".* FROM "tickets" WHERE "tickets"."route_id" = $1  [["route_id", 34]]

  def pnr
    @routes = Route.all
---
SELECT "routes".* FROM "routes" ORDER BY "routes"."id" ASC LIMIT $1  [["LIMIT", 1]]