app/controllers/stations_controller.rb

SELECT "stations".* FROM "stations"
---
  def index
    @stations = Station.all

SELECT "routes".* FROM "routes" WHERE "routes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "stations" ("station_name", "arrival", "departure", "distance", "seats", "route_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    route = Route.find(params[:route_id])
    @station = route.stations.new(station_param)
     if @station.save