app/views/routes/index.html.erb

SELECT "stations"."station_name" FROM "stations" WHERE "stations"."route_id" = $1  [["route_id", 1]]
---
<%@routes.each do |route|%>
  <%station = route.stations.pluck(:station_name)%>