app/views/routes/pnr.html.erb

SELECT "tickets".* FROM "tickets" WHERE "tickets"."pnr" = $1 LIMIT $2  [["pnr", "490691"], ["LIMIT", 1]]
---

<%@ticke = Ticket.find_by(pnr:@pnr)%>